ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG0_PR1_ICSS_INTC_INTC_SLV.xml
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_ENA_STATUS_REG1" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_ENA_STATUS_REG1" offset="0x284" width="32" description="">
		<bitfield id="ENA_STATUS_63" width="1" begin="31" end="31" resetval="0x0" description=" Enabled Status for intr_in[63]" range="31" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_62" width="1" begin="30" end="30" resetval="0x0" description=" Enabled Status for intr_in[62]" range="30" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_61" width="1" begin="29" end="29" resetval="0x0" description=" Enabled Status for intr_in[61]" range="29" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_60" width="1" begin="28" end="28" resetval="0x0" description=" Enabled Status for intr_in[60]" range="28" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_59" width="1" begin="27" end="27" resetval="0x0" description=" Enabled Status for intr_in[59]" range="27" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_58" width="1" begin="26" end="26" resetval="0x0" description=" Enabled Status for intr_in[58]" range="26" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_57" width="1" begin="25" end="25" resetval="0x0" description=" Enabled Status for intr_in[57]" range="25" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_56" width="1" begin="24" end="24" resetval="0x0" description=" Enabled Status for intr_in[56]" range="24" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_55" width="1" begin="23" end="23" resetval="0x0" description=" Enabled Status for intr_in[55]" range="23" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_54" width="1" begin="22" end="22" resetval="0x0" description=" Enabled Status for intr_in[54]" range="22" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_53" width="1" begin="21" end="21" resetval="0x0" description=" Enabled Status for intr_in[53]" range="21" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_52" width="1" begin="20" end="20" resetval="0x0" description=" Enabled Status for intr_in[52]" range="20" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_51" width="1" begin="19" end="19" resetval="0x0" description=" Enabled Status for intr_in[51]" range="19" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_50" width="1" begin="18" end="18" resetval="0x0" description=" Enabled Status for intr_in[50]" range="18" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_49" width="1" begin="17" end="17" resetval="0x0" description=" Enabled Status for intr_in[49]" range="17" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_48" width="1" begin="16" end="16" resetval="0x0" description=" Enabled Status for intr_in[48]" range="16" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_47" width="1" begin="15" end="15" resetval="0x0" description=" Enabled Status for intr_in[47]" range="15" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_46" width="1" begin="14" end="14" resetval="0x0" description=" Enabled Status for intr_in[46]" range="14" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_45" width="1" begin="13" end="13" resetval="0x0" description=" Enabled Status for intr_in[45]" range="13" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_44" width="1" begin="12" end="12" resetval="0x0" description=" Enabled Status for intr_in[44]" range="12" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_43" width="1" begin="11" end="11" resetval="0x0" description=" Enabled Status for intr_in[43]" range="11" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_42" width="1" begin="10" end="10" resetval="0x0" description=" Enabled Status for intr_in[42]" range="10" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_41" width="1" begin="9" end="9" resetval="0x0" description=" Enabled Status for intr_in[41]" range="9" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_40" width="1" begin="8" end="8" resetval="0x0" description=" Enabled Status for intr_in[40]" range="8" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_39" width="1" begin="7" end="7" resetval="0x0" description=" Enabled Status for intr_in[39]" range="7" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_38" width="1" begin="6" end="6" resetval="0x0" description=" Enabled Status for intr_in[38]" range="6" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_37" width="1" begin="5" end="5" resetval="0x0" description=" Enabled Status for intr_in[37]" range="5" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_36" width="1" begin="4" end="4" resetval="0x0" description=" Enabled Status for intr_in[36]" range="4" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_35" width="1" begin="3" end="3" resetval="0x0" description=" Enabled Status for intr_in[35]" range="3" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_34" width="1" begin="2" end="2" resetval="0x0" description=" Enabled Status for intr_in[34]" range="2" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_33" width="1" begin="1" end="1" resetval="0x0" description=" Enabled Status for intr_in[33]" range="1" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_32" width="1" begin="0" end="0" resetval="0x0" description=" Enabled Status for intr_in[32]" range="0" rwaccess="W1TC"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_ENA_STATUS_REG2" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_ENA_STATUS_REG2" offset="0x288" width="32" description="">
		<bitfield id="ENA_STATUS_95" width="1" begin="31" end="31" resetval="0x0" description=" Enabled Status for slv_events_in[31]" range="31" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_94" width="1" begin="30" end="30" resetval="0x0" description=" Enabled Status for slv_events_in[30]" range="30" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_93" width="1" begin="29" end="29" resetval="0x0" description=" Enabled Status for slv_events_in[29]" range="29" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_92" width="1" begin="28" end="28" resetval="0x0" description=" Enabled Status for slv_events_in[28]" range="28" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_91" width="1" begin="27" end="27" resetval="0x0" description=" Enabled Status for slv_events_in[27]" range="27" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_90" width="1" begin="26" end="26" resetval="0x0" description=" Enabled Status for slv_events_in[26]" range="26" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_89" width="1" begin="25" end="25" resetval="0x0" description=" Enabled Status for slv_events_in[25]" range="25" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_88" width="1" begin="24" end="24" resetval="0x0" description=" Enabled Status for slv_events_in[24]" range="24" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_87" width="1" begin="23" end="23" resetval="0x0" description=" Enabled Status for slv_events_in[23]" range="23" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_86" width="1" begin="22" end="22" resetval="0x0" description=" Enabled Status for slv_events_in[22]" range="22" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_85" width="1" begin="21" end="21" resetval="0x0" description=" Enabled Status for slv_events_in[21]" range="21" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_84" width="1" begin="20" end="20" resetval="0x0" description=" Enabled Status for slv_events_in[20]" range="20" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_83" width="1" begin="19" end="19" resetval="0x0" description=" Enabled Status for slv_events_in[19]" range="19" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_82" width="1" begin="18" end="18" resetval="0x0" description=" Enabled Status for slv_events_in[18]" range="18" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_81" width="1" begin="17" end="17" resetval="0x0" description=" Enabled Status for slv_events_in[17]" range="17" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_80" width="1" begin="16" end="16" resetval="0x0" description=" Enabled Status for slv_events_in[16]" range="16" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_79" width="1" begin="15" end="15" resetval="0x0" description=" Enabled Status for slv_events_in[15]" range="15" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_78" width="1" begin="14" end="14" resetval="0x0" description=" Enabled Status for slv_events_in[14]" range="14" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_77" width="1" begin="13" end="13" resetval="0x0" description=" Enabled Status for slv_events_in[13]" range="13" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_76" width="1" begin="12" end="12" resetval="0x0" description=" Enabled Status for slv_events_in[12]" range="12" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_75" width="1" begin="11" end="11" resetval="0x0" description=" Enabled Status for slv_events_in[11]" range="11" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_74" width="1" begin="10" end="10" resetval="0x0" description=" Enabled Status for slv_events_in[10]" range="10" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_73" width="1" begin="9" end="9" resetval="0x0" description=" Enabled Status for slv_events_in[9]" range="9" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_72" width="1" begin="8" end="8" resetval="0x0" description=" Enabled Status for slv_events_in[8]" range="8" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_71" width="1" begin="7" end="7" resetval="0x0" description=" Enabled Status for slv_events_in[7]" range="7" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_70" width="1" begin="6" end="6" resetval="0x0" description=" Enabled Status for slv_events_in[6]" range="6" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_69" width="1" begin="5" end="5" resetval="0x0" description=" Enabled Status for slv_events_in[5]" range="5" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_68" width="1" begin="4" end="4" resetval="0x0" description=" Enabled Status for slv_events_in[4]" range="4" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_67" width="1" begin="3" end="3" resetval="0x0" description=" Enabled Status for slv_events_in[3]" range="3" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_66" width="1" begin="2" end="2" resetval="0x0" description=" Enabled Status for slv_events_in[2]" range="2" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_65" width="1" begin="1" end="1" resetval="0x0" description=" Enabled Status for slv_events_in[1]" range="1" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_64" width="1" begin="0" end="0" resetval="0x0" description=" Enabled Status for slv_events_in[0]" range="0" rwaccess="W1TC"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_ENA_STATUS_REG3" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_ENA_STATUS_REG3" offset="0x28C" width="32" description="">
		<bitfield id="ENA_STATUS_127" width="1" begin="31" end="31" resetval="0x0" description=" Enabled Status for slv_events_in[63]" range="31" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_126" width="1" begin="30" end="30" resetval="0x0" description=" Enabled Status for slv_events_in[62]" range="30" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_125" width="1" begin="29" end="29" resetval="0x0" description=" Enabled Status for slv_events_in[61]" range="29" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_124" width="1" begin="28" end="28" resetval="0x0" description=" Enabled Status for slv_events_in[60]" range="28" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_123" width="1" begin="27" end="27" resetval="0x0" description=" Enabled Status for slv_events_in[59]" range="27" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_122" width="1" begin="26" end="26" resetval="0x0" description=" Enabled Status for slv_events_in[58]" range="26" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_121" width="1" begin="25" end="25" resetval="0x0" description=" Enabled Status for slv_events_in[57]" range="25" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_120" width="1" begin="24" end="24" resetval="0x0" description=" Enabled Status for slv_events_in[56]" range="24" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_119" width="1" begin="23" end="23" resetval="0x0" description=" Enabled Status for slv_events_in[55]" range="23" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_118" width="1" begin="22" end="22" resetval="0x0" description=" Enabled Status for slv_events_in[54]" range="22" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_117" width="1" begin="21" end="21" resetval="0x0" description=" Enabled Status for slv_events_in[53]" range="21" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_116" width="1" begin="20" end="20" resetval="0x0" description=" Enabled Status for slv_events_in[52]" range="20" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_115" width="1" begin="19" end="19" resetval="0x0" description=" Enabled Status for slv_events_in[51]" range="19" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_114" width="1" begin="18" end="18" resetval="0x0" description=" Enabled Status for slv_events_in[50]" range="18" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_113" width="1" begin="17" end="17" resetval="0x0" description=" Enabled Status for slv_events_in[49]" range="17" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_112" width="1" begin="16" end="16" resetval="0x0" description=" Enabled Status for slv_events_in[48]" range="16" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_111" width="1" begin="15" end="15" resetval="0x0" description=" Enabled Status for slv_events_in[47]" range="15" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_110" width="1" begin="14" end="14" resetval="0x0" description=" Enabled Status for slv_events_in[46]" range="14" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_109" width="1" begin="13" end="13" resetval="0x0" description=" Enabled Status for slv_events_in[45]" range="13" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_108" width="1" begin="12" end="12" resetval="0x0" description=" Enabled Status for slv_events_in[44]" range="12" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_107" width="1" begin="11" end="11" resetval="0x0" description=" Enabled Status for slv_events_in[43]" range="11" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_106" width="1" begin="10" end="10" resetval="0x0" description=" Enabled Status for slv_events_in[42]" range="10" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_105" width="1" begin="9" end="9" resetval="0x0" description=" Enabled Status for slv_events_in[41]" range="9" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_104" width="1" begin="8" end="8" resetval="0x0" description=" Enabled Status for slv_events_in[40]" range="8" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_103" width="1" begin="7" end="7" resetval="0x0" description=" Enabled Status for slv_events_in[39]" range="7" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_102" width="1" begin="6" end="6" resetval="0x0" description=" Enabled Status for slv_events_in[38]" range="6" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_101" width="1" begin="5" end="5" resetval="0x0" description=" Enabled Status for slv_events_in[37]" range="5" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_100" width="1" begin="4" end="4" resetval="0x0" description=" Enabled Status for slv_events_in[36]" range="4" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_99" width="1" begin="3" end="3" resetval="0x0" description=" Enabled Status for slv_events_in[35]" range="3" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_98" width="1" begin="2" end="2" resetval="0x0" description=" Enabled Status for slv_events_in[34]" range="2" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_97" width="1" begin="1" end="1" resetval="0x0" description=" Enabled Status for slv_events_in[33]" range="1" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_96" width="1" begin="0" end="0" resetval="0x0" description=" Enabled Status for slv_events_in[32]" range="0" rwaccess="W1TC"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_ENA_STATUS_REG4" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_ENA_STATUS_REG4" offset="0x290" width="32" description="">
		<bitfield id="ENA_STATUS_159" width="1" begin="31" end="31" resetval="0x0" description=" Enabled Status for slv_events_in[95]" range="31" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_158" width="1" begin="30" end="30" resetval="0x0" description=" Enabled Status for slv_events_in[94]" range="30" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_157" width="1" begin="29" end="29" resetval="0x0" description=" Enabled Status for slv_events_in[93]" range="29" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_156" width="1" begin="28" end="28" resetval="0x0" description=" Enabled Status for slv_events_in[92]" range="28" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_155" width="1" begin="27" end="27" resetval="0x0" description=" Enabled Status for slv_events_in[91]" range="27" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_154" width="1" begin="26" end="26" resetval="0x0" description=" Enabled Status for slv_events_in[90]" range="26" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_153" width="1" begin="25" end="25" resetval="0x0" description=" Enabled Status for slv_events_in[89]" range="25" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_152" width="1" begin="24" end="24" resetval="0x0" description=" Enabled Status for slv_events_in[88]" range="24" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_151" width="1" begin="23" end="23" resetval="0x0" description=" Enabled Status for slv_events_in[87]" range="23" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_150" width="1" begin="22" end="22" resetval="0x0" description=" Enabled Status for slv_events_in[86]" range="22" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_149" width="1" begin="21" end="21" resetval="0x0" description=" Enabled Status for slv_events_in[85]" range="21" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_148" width="1" begin="20" end="20" resetval="0x0" description=" Enabled Status for slv_events_in[84]" range="20" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_147" width="1" begin="19" end="19" resetval="0x0" description=" Enabled Status for slv_events_in[83]" range="19" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_146" width="1" begin="18" end="18" resetval="0x0" description=" Enabled Status for slv_events_in[82]" range="18" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_145" width="1" begin="17" end="17" resetval="0x0" description=" Enabled Status for slv_events_in[81]" range="17" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_144" width="1" begin="16" end="16" resetval="0x0" description=" Enabled Status for slv_events_in[80]" range="16" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_143" width="1" begin="15" end="15" resetval="0x0" description=" Enabled Status for slv_events_in[79]" range="15" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_142" width="1" begin="14" end="14" resetval="0x0" description=" Enabled Status for slv_events_in[78]" range="14" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_141" width="1" begin="13" end="13" resetval="0x0" description=" Enabled Status for slv_events_in[77]" range="13" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_140" width="1" begin="12" end="12" resetval="0x0" description=" Enabled Status for slv_events_in[76]" range="12" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_139" width="1" begin="11" end="11" resetval="0x0" description=" Enabled Status for slv_events_in[75]" range="11" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_138" width="1" begin="10" end="10" resetval="0x0" description=" Enabled Status for slv_events_in[74]" range="10" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_137" width="1" begin="9" end="9" resetval="0x0" description=" Enabled Status for slv_events_in[73]" range="9" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_136" width="1" begin="8" end="8" resetval="0x0" description=" Enabled Status for slv_events_in[72]" range="8" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_135" width="1" begin="7" end="7" resetval="0x0" description=" Enabled Status for slv_events_in[71]" range="7" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_134" width="1" begin="6" end="6" resetval="0x0" description=" Enabled Status for slv_events_in[70]" range="6" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_133" width="1" begin="5" end="5" resetval="0x0" description=" Enabled Status for slv_events_in[69]" range="5" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_132" width="1" begin="4" end="4" resetval="0x0" description=" Enabled Status for slv_events_in[68]" range="4" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_131" width="1" begin="3" end="3" resetval="0x0" description=" Enabled Status for slv_events_in[67]" range="3" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_130" width="1" begin="2" end="2" resetval="0x0" description=" Enabled Status for slv_events_in[66]" range="2" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_129" width="1" begin="1" end="1" resetval="0x0" description=" Enabled Status for slv_events_in[65]" range="1" rwaccess="W1TC"/> 
		<bitfield id="ENA_STATUS_128" width="1" begin="0" end="0" resetval="0x0" description=" Enabled Status for slv_events_in[64]" range="0" rwaccess="W1TC"/>
	</register>
