ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG0_PR1_ICSS_INTC_INTC_SLV.xml
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_ENABLE_CLR_REG3" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_ENABLE_CLR_REG3" offset="0x38C" width="32" description="">
		<bitfield id="ENABLE_127_CLR" width="1" begin="31" end="31" resetval="0x0" description=" Enable clear for slv_events_in[63]" range="31" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_126_CLR" width="1" begin="30" end="30" resetval="0x0" description=" Enable clear for slv_events_in[62]" range="30" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_125_CLR" width="1" begin="29" end="29" resetval="0x0" description=" Enable clear for slv_events_in[61]" range="29" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_124_CLR" width="1" begin="28" end="28" resetval="0x0" description=" Enable clear for slv_events_in[60]" range="28" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_123_CLR" width="1" begin="27" end="27" resetval="0x0" description=" Enable clear for slv_events_in[59]" range="27" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_122_CLR" width="1" begin="26" end="26" resetval="0x0" description=" Enable clear for slv_events_in[58]" range="26" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_121_CLR" width="1" begin="25" end="25" resetval="0x0" description=" Enable clear for slv_events_in[57]" range="25" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_120_CLR" width="1" begin="24" end="24" resetval="0x0" description=" Enable clear for slv_events_in[56]" range="24" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_119_CLR" width="1" begin="23" end="23" resetval="0x0" description=" Enable clear for slv_events_in[55]" range="23" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_118_CLR" width="1" begin="22" end="22" resetval="0x0" description=" Enable clear for slv_events_in[54]" range="22" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_117_CLR" width="1" begin="21" end="21" resetval="0x0" description=" Enable clear for slv_events_in[53]" range="21" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_116_CLR" width="1" begin="20" end="20" resetval="0x0" description=" Enable clear for slv_events_in[52]" range="20" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_115_CLR" width="1" begin="19" end="19" resetval="0x0" description=" Enable clear for slv_events_in[51]" range="19" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_114_CLR" width="1" begin="18" end="18" resetval="0x0" description=" Enable clear for slv_events_in[50]" range="18" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_113_CLR" width="1" begin="17" end="17" resetval="0x0" description=" Enable clear for slv_events_in[49]" range="17" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_112_CLR" width="1" begin="16" end="16" resetval="0x0" description=" Enable clear for slv_events_in[48]" range="16" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_111_CLR" width="1" begin="15" end="15" resetval="0x0" description=" Enable clear for slv_events_in[47]" range="15" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_110_CLR" width="1" begin="14" end="14" resetval="0x0" description=" Enable clear for slv_events_in[46]" range="14" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_109_CLR" width="1" begin="13" end="13" resetval="0x0" description=" Enable clear for slv_events_in[45]" range="13" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_108_CLR" width="1" begin="12" end="12" resetval="0x0" description=" Enable clear for slv_events_in[44]" range="12" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_107_CLR" width="1" begin="11" end="11" resetval="0x0" description=" Enable clear for slv_events_in[43]" range="11" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_106_CLR" width="1" begin="10" end="10" resetval="0x0" description=" Enable clear for slv_events_in[42]" range="10" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_105_CLR" width="1" begin="9" end="9" resetval="0x0" description=" Enable clear for slv_events_in[41]" range="9" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_104_CLR" width="1" begin="8" end="8" resetval="0x0" description=" Enable clear for slv_events_in[40]" range="8" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_103_CLR" width="1" begin="7" end="7" resetval="0x0" description=" Enable clear for slv_events_in[39]" range="7" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_102_CLR" width="1" begin="6" end="6" resetval="0x0" description=" Enable clear for slv_events_in[38]" range="6" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_101_CLR" width="1" begin="5" end="5" resetval="0x0" description=" Enable clear for slv_events_in[37]" range="5" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_100_CLR" width="1" begin="4" end="4" resetval="0x0" description=" Enable clear for slv_events_in[36]" range="4" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_99_CLR" width="1" begin="3" end="3" resetval="0x0" description=" Enable clear for slv_events_in[35]" range="3" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_98_CLR" width="1" begin="2" end="2" resetval="0x0" description=" Enable clear for slv_events_in[34]" range="2" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_97_CLR" width="1" begin="1" end="1" resetval="0x0" description=" Enable clear for slv_events_in[33]" range="1" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_96_CLR" width="1" begin="0" end="0" resetval="0x0" description=" Enable clear for slv_events_in[32]" range="0" rwaccess="W1TC"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_ENABLE_CLR_REG4" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_ENABLE_CLR_REG4" offset="0x390" width="32" description="">
		<bitfield id="ENABLE_159_CLR" width="1" begin="31" end="31" resetval="0x0" description=" Enable clear for slv_events_in[95]" range="31" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_158_CLR" width="1" begin="30" end="30" resetval="0x0" description=" Enable clear for slv_events_in[94]" range="30" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_157_CLR" width="1" begin="29" end="29" resetval="0x0" description=" Enable clear for slv_events_in[93]" range="29" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_156_CLR" width="1" begin="28" end="28" resetval="0x0" description=" Enable clear for slv_events_in[92]" range="28" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_155_CLR" width="1" begin="27" end="27" resetval="0x0" description=" Enable clear for slv_events_in[91]" range="27" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_154_CLR" width="1" begin="26" end="26" resetval="0x0" description=" Enable clear for slv_events_in[90]" range="26" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_153_CLR" width="1" begin="25" end="25" resetval="0x0" description=" Enable clear for slv_events_in[89]" range="25" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_152_CLR" width="1" begin="24" end="24" resetval="0x0" description=" Enable clear for slv_events_in[88]" range="24" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_151_CLR" width="1" begin="23" end="23" resetval="0x0" description=" Enable clear for slv_events_in[87]" range="23" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_150_CLR" width="1" begin="22" end="22" resetval="0x0" description=" Enable clear for slv_events_in[86]" range="22" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_149_CLR" width="1" begin="21" end="21" resetval="0x0" description=" Enable clear for slv_events_in[85]" range="21" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_148_CLR" width="1" begin="20" end="20" resetval="0x0" description=" Enable clear for slv_events_in[84]" range="20" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_147_CLR" width="1" begin="19" end="19" resetval="0x0" description=" Enable clear for slv_events_in[83]" range="19" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_146_CLR" width="1" begin="18" end="18" resetval="0x0" description=" Enable clear for slv_events_in[82]" range="18" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_145_CLR" width="1" begin="17" end="17" resetval="0x0" description=" Enable clear for slv_events_in[81]" range="17" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_144_CLR" width="1" begin="16" end="16" resetval="0x0" description=" Enable clear for slv_events_in[80]" range="16" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_143_CLR" width="1" begin="15" end="15" resetval="0x0" description=" Enable clear for slv_events_in[79]" range="15" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_142_CLR" width="1" begin="14" end="14" resetval="0x0" description=" Enable clear for slv_events_in[78]" range="14" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_141_CLR" width="1" begin="13" end="13" resetval="0x0" description=" Enable clear for slv_events_in[77]" range="13" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_140_CLR" width="1" begin="12" end="12" resetval="0x0" description=" Enable clear for slv_events_in[76]" range="12" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_139_CLR" width="1" begin="11" end="11" resetval="0x0" description=" Enable clear for slv_events_in[75]" range="11" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_138_CLR" width="1" begin="10" end="10" resetval="0x0" description=" Enable clear for slv_events_in[74]" range="10" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_137_CLR" width="1" begin="9" end="9" resetval="0x0" description=" Enable clear for slv_events_in[73]" range="9" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_136_CLR" width="1" begin="8" end="8" resetval="0x0" description=" Enable clear for slv_events_in[72]" range="8" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_135_CLR" width="1" begin="7" end="7" resetval="0x0" description=" Enable clear for slv_events_in[71]" range="7" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_134_CLR" width="1" begin="6" end="6" resetval="0x0" description=" Enable clear for slv_events_in[70]" range="6" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_133_CLR" width="1" begin="5" end="5" resetval="0x0" description=" Enable clear for slv_events_in[69]" range="5" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_132_CLR" width="1" begin="4" end="4" resetval="0x0" description=" Enable clear for slv_events_in[68]" range="4" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_131_CLR" width="1" begin="3" end="3" resetval="0x0" description=" Enable clear for slv_events_in[67]" range="3" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_130_CLR" width="1" begin="2" end="2" resetval="0x0" description=" Enable clear for slv_events_in[66]" range="2" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_129_CLR" width="1" begin="1" end="1" resetval="0x0" description=" Enable clear for slv_events_in[65]" range="1" rwaccess="W1TC"/> 
		<bitfield id="ENABLE_128_CLR" width="1" begin="0" end="0" resetval="0x0" description=" Enable clear for slv_events_in[64]" range="0" rwaccess="W1TC"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG0" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG0" offset="0x400" width="32" description="">
		<bitfield id="CH_MAP_3" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for intr_in[3]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_2" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for intr_in[2]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_1" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for intr_in[1]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_0" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for intr_in[0]" range="4 - 0" rwaccess="W"/>
	</register>
