ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG0_PR1_ICSS_INTC_INTC_SLV.xml
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG1" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG1" offset="0x404" width="32" description="">
		<bitfield id="CH_MAP_7" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for intr_in[7]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_6" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for intr_in[6]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_5" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for intr_in[5]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_4" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for intr_in[4]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG2" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG2" offset="0x408" width="32" description="">
		<bitfield id="CH_MAP_11" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for intr_in[11]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_10" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for intr_in[10]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_9" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for intr_in[9]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_8" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for intr_in[8]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG3" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG3" offset="0x40C" width="32" description="">
		<bitfield id="CH_MAP_15" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for intr_in[15]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_14" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for intr_in[14]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_13" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for intr_in[13]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_12" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for intr_in[12]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG4" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG4" offset="0x410" width="32" description="">
		<bitfield id="CH_MAP_19" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for intr_in[19]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_18" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for intr_in[18]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_17" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for intr_in[17]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_16" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for intr_in[16]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG5" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG5" offset="0x414" width="32" description="">
		<bitfield id="CH_MAP_23" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for intr_in[23]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_22" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for intr_in[22]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_21" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for intr_in[21]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_20" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for intr_in[20]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG6" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG6" offset="0x418" width="32" description="">
		<bitfield id="CH_MAP_27" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for intr_in[27]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_26" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for intr_in[26]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_25" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for intr_in[25]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_24" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for intr_in[24]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG7" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG7" offset="0x41C" width="32" description="">
		<bitfield id="CH_MAP_31" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for intr_in[31]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_30" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for intr_in[30]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_29" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for intr_in[29]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_28" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for intr_in[28]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG8" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG8" offset="0x420" width="32" description="">
		<bitfield id="CH_MAP_35" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for intr_in[35]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_34" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for intr_in[34]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_33" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for intr_in[33]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_32" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for intr_in[32]" range="4 - 0" rwaccess="R/W"/>
	</register>
