ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG0_PR1_ICSS_INTC_INTC_SLV.xml
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG9" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG9" offset="0x424" width="32" description="">
		<bitfield id="CH_MAP_39" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for intr_in[39]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_38" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for intr_in[38]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_37" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for intr_in[37]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_36" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for intr_in[36]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG10" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG10" offset="0x428" width="32" description="">
		<bitfield id="CH_MAP_43" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for intr_in[43]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_42" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for intr_in[42]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_41" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for intr_in[41]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_40" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for intr_in[40]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG11" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG11" offset="0x42C" width="32" description="">
		<bitfield id="CH_MAP_47" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for intr_in[47]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_46" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for intr_in[46]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_45" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for intr_in[45]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_44" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for intr_in[44]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG12" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG12" offset="0x430" width="32" description="">
		<bitfield id="CH_MAP_51" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for intr_in[51]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_50" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for intr_in[50]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_49" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for intr_in[49]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_48" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for intr_in[48]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG13" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG13" offset="0x434" width="32" description="">
		<bitfield id="CH_MAP_55" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for intr_in[55]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_54" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for intr_in[54]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_53" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for intr_in[53]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_52" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for intr_in[52]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG14" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG14" offset="0x438" width="32" description="">
		<bitfield id="CH_MAP_59" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for intr_in[59]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_58" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for intr_in[58]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_57" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for intr_in[57]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_56" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for intr_in[56]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG15" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG15" offset="0x43C" width="32" description="">
		<bitfield id="CH_MAP_63" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for intr_in[63]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_62" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for intr_in[62]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_61" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for intr_in[61]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_60" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for intr_in[60]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG16" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG16" offset="0x440" width="32" description="">
		<bitfield id="CH_MAP_67" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[3]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_66" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[2]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_65" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[1]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_64" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[0]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG17" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG17" offset="0x444" width="32" description="">
		<bitfield id="CH_MAP_71" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[7]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_70" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[6]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_69" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[5]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_68" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[4]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG18" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG18" offset="0x448" width="32" description="">
		<bitfield id="CH_MAP_75" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[11]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_74" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[10]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_73" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[9]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_72" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[8]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG19" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG19" offset="0x44C" width="32" description="">
		<bitfield id="CH_MAP_79" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[15]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_78" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[14]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_77" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[13]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_76" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[12]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG20" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG20" offset="0x450" width="32" description="">
		<bitfield id="CH_MAP_83" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[19]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_82" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[18]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_81" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[17]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_80" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[16]" range="4 - 0" rwaccess="R/W"/>
	</register>
