ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG0_PR1_ICSS_INTC_INTC_SLV.xml
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG21" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG21" offset="0x454" width="32" description="">
		<bitfield id="CH_MAP_87" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[23]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_86" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[22]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_85" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[21]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_84" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[20]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG22" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG22" offset="0x458" width="32" description="">
		<bitfield id="CH_MAP_91" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[27]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_90" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[26]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_89" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[25]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_88" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[24]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG23" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG23" offset="0x45C" width="32" description="">
		<bitfield id="CH_MAP_95" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[31]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_94" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[30]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_93" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[29]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_92" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[28]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG24" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG24" offset="0x460" width="32" description="">
		<bitfield id="CH_MAP_99" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[35]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_98" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[34]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_97" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[33]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_96" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[32]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG25" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG25" offset="0x464" width="32" description="">
		<bitfield id="CH_MAP_103" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[39]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_102" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[38]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_101" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[37]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_100" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[36]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG26" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG26" offset="0x468" width="32" description="">
		<bitfield id="CH_MAP_107" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[43]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_106" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[42]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_105" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[41]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_104" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[40]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG27" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG27" offset="0x46C" width="32" description="">
		<bitfield id="CH_MAP_111" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[47]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_110" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[46]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_109" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[45]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_108" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[44]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG28" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG28" offset="0x470" width="32" description="">
		<bitfield id="CH_MAP_115" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[51]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_114" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[50]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_113" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[49]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_112" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[48]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG29" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG29" offset="0x474" width="32" description="">
		<bitfield id="CH_MAP_119" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[55]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_118" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[54]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_117" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[53]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_116" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[52]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG30" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG30" offset="0x478" width="32" description="">
		<bitfield id="CH_MAP_123" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[59]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_122" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[58]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_121" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[57]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_120" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[56]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG31" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG31" offset="0x47C" width="32" description="">
		<bitfield id="CH_MAP_127" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[63]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_126" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[62]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_125" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[61]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_124" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[60]" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG32" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_CH_MAP_REG32" offset="0x480" width="32" description="">
		<bitfield id="CH_MAP_131" width="5" begin="28" end="24" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[67]" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_130" width="5" begin="20" end="16" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[66]" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_129" width="5" begin="12" end="8" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[65]" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="CH_MAP_128" width="5" begin="4" end="0" resetval="0x0" description=" Interrupt Channel Map for slv_events_in[64]" range="4 - 0" rwaccess="R/W"/>
	</register>
