ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG0_PR1_ICSS_INTC_INTC_SLV.xml
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_HINT_MAP_REG3" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_HINT_MAP_REG3" offset="0x80C" width="32" description="">
		<bitfield id="HINT_MAP_15" width="5" begin="28" end="24" resetval="0x0" description=" Host Interrupt Map for Channel 15" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="HINT_MAP_14" width="5" begin="20" end="16" resetval="0x0" description=" Host Interrupt Map for Channel 14" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="HINT_MAP_13" width="5" begin="12" end="8" resetval="0x0" description=" Host Interrupt Map for Channel 13" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="HINT_MAP_12" width="5" begin="4" end="0" resetval="0x0" description=" Host Interrupt Map for Channel 12" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_HINT_MAP_REG4" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_HINT_MAP_REG4" offset="0x810" width="32" description="">
		<bitfield id="HINT_MAP_19" width="5" begin="28" end="24" resetval="0x0" description=" Host Interrupt Map for Channel 19" range="28 - 24" rwaccess="R/W"/> 
		<bitfield id="HINT_MAP_18" width="5" begin="20" end="16" resetval="0x0" description=" Host Interrupt Map for Channel 18" range="20 - 16" rwaccess="R/W"/> 
		<bitfield id="HINT_MAP_17" width="5" begin="12" end="8" resetval="0x0" description=" Host Interrupt Map for Channel 17" range="12 - 8" rwaccess="R/W"/> 
		<bitfield id="HINT_MAP_16" width="5" begin="4" end="0" resetval="0x0" description=" Host Interrupt Map for Channel 16" range="4 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG0" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG0" offset="0x900" width="32" description="">
		<bitfield id="NONE_HINT_0" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/> 
		<bitfield id="PRI_HINT_0" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 0 Prioritized Interrupt" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG1" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG1" offset="0x904" width="32" description="">
		<bitfield id="NONE_HINT_1" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/> 
		<bitfield id="PRI_HINT_1" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 1 Prioritized Interrupt" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG2" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG2" offset="0x908" width="32" description="">
		<bitfield id="NONE_HINT_2" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/> 
		<bitfield id="PRI_HINT_2" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 2 Prioritized Interrupt" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG3" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG3" offset="0x90C" width="32" description="">
		<bitfield id="NONE_HINT_3" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/> 
		<bitfield id="PRI_HINT_3" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 3 Prioritized Interrupt" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG4" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG4" offset="0x910" width="32" description="">
		<bitfield id="NONE_HINT_4" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/> 
		<bitfield id="PRI_HINT_4" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 4 Prioritized Interrupt" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG5" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG5" offset="0x914" width="32" description="">
		<bitfield id="NONE_HINT_5" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/> 
		<bitfield id="PRI_HINT_5" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 5 Prioritized Interrupt" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG6" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG6" offset="0x918" width="32" description="">
		<bitfield id="NONE_HINT_6" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/> 
		<bitfield id="PRI_HINT_6" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 6 Prioritized Interrupt" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG7" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG7" offset="0x91C" width="32" description="">
		<bitfield id="NONE_HINT_7" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/> 
		<bitfield id="PRI_HINT_7" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 7 Prioritized Interrupt" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG8" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG8" offset="0x920" width="32" description="">
		<bitfield id="NONE_HINT_8" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/> 
		<bitfield id="PRI_HINT_8" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 8 Prioritized Interrupt" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG9" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG9" offset="0x924" width="32" description="">
		<bitfield id="NONE_HINT_9" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/> 
		<bitfield id="PRI_HINT_9" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 9 Prioritized Interrupt" range="9 - 0" rwaccess="R"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG10" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_PRI_HINT_REG10" offset="0x928" width="32" description="">
		<bitfield id="NONE_HINT_10" width="1" begin="31" end="31" resetval="0x1" description=" No interrupt pending flag" range="31" rwaccess="R"/> 
		<bitfield id="PRI_HINT_10" width="10" begin="9" end="0" resetval="0x0" description=" Host Int 10 Prioritized Interrupt" range="9 - 0" rwaccess="R"/>
	</register>
