ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG0_PR1_ICSS_INTC_INTC_SLV.xml
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_TYPE_REG4" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_TYPE_REG4" offset="0xD90" width="32" description="">
		<bitfield id="TYPE_159" width="1" begin="31" end="31" resetval="0x0" description=" Type for slv_events_in[95] 0=level" range="31" rwaccess="R/W"/> 
		<bitfield id="TYPE_158" width="1" begin="30" end="30" resetval="0x0" description=" Type for slv_events_in[94] 0=level" range="30" rwaccess="R/W"/> 
		<bitfield id="TYPE_157" width="1" begin="29" end="29" resetval="0x0" description=" Type for slv_events_in[93] 0=level" range="29" rwaccess="R/W"/> 
		<bitfield id="TYPE_156" width="1" begin="28" end="28" resetval="0x0" description=" Type for slv_events_in[92] 0=level" range="28" rwaccess="R/W"/> 
		<bitfield id="TYPE_155" width="1" begin="27" end="27" resetval="0x0" description=" Type for slv_events_in[91] 0=level" range="27" rwaccess="R/W"/> 
		<bitfield id="TYPE_154" width="1" begin="26" end="26" resetval="0x0" description=" Type for slv_events_in[90] 0=level" range="26" rwaccess="R/W"/> 
		<bitfield id="TYPE_153" width="1" begin="25" end="25" resetval="0x0" description=" Type for slv_events_in[89] 0=level" range="25" rwaccess="R/W"/> 
		<bitfield id="TYPE_152" width="1" begin="24" end="24" resetval="0x0" description=" Type for slv_events_in[88] 0=level" range="24" rwaccess="R/W"/> 
		<bitfield id="TYPE_151" width="1" begin="23" end="23" resetval="0x0" description=" Type for slv_events_in[87] 0=level" range="23" rwaccess="R/W"/> 
		<bitfield id="TYPE_150" width="1" begin="22" end="22" resetval="0x0" description=" Type for slv_events_in[86] 0=level" range="22" rwaccess="R/W"/> 
		<bitfield id="TYPE_149" width="1" begin="21" end="21" resetval="0x0" description=" Type for slv_events_in[85] 0=level" range="21" rwaccess="R/W"/> 
		<bitfield id="TYPE_148" width="1" begin="20" end="20" resetval="0x0" description=" Type for slv_events_in[84] 0=level" range="20" rwaccess="R/W"/> 
		<bitfield id="TYPE_147" width="1" begin="19" end="19" resetval="0x0" description=" Type for slv_events_in[83] 0=level" range="19" rwaccess="R/W"/> 
		<bitfield id="TYPE_146" width="1" begin="18" end="18" resetval="0x0" description=" Type for slv_events_in[82] 0=level" range="18" rwaccess="R/W"/> 
		<bitfield id="TYPE_145" width="1" begin="17" end="17" resetval="0x0" description=" Type for slv_events_in[81] 0=level" range="17" rwaccess="R/W"/> 
		<bitfield id="TYPE_144" width="1" begin="16" end="16" resetval="0x0" description=" Type for slv_events_in[80] 0=level" range="16" rwaccess="R/W"/> 
		<bitfield id="TYPE_143" width="1" begin="15" end="15" resetval="0x0" description=" Type for slv_events_in[79] 0=level" range="15" rwaccess="R/W"/> 
		<bitfield id="TYPE_142" width="1" begin="14" end="14" resetval="0x0" description=" Type for slv_events_in[78] 0=level" range="14" rwaccess="R/W"/> 
		<bitfield id="TYPE_141" width="1" begin="13" end="13" resetval="0x0" description=" Type for slv_events_in[77] 0=level" range="13" rwaccess="R/W"/> 
		<bitfield id="TYPE_140" width="1" begin="12" end="12" resetval="0x0" description=" Type for slv_events_in[76] 0=level" range="12" rwaccess="R/W"/> 
		<bitfield id="TYPE_139" width="1" begin="11" end="11" resetval="0x0" description=" Type for slv_events_in[75] 0=level" range="11" rwaccess="R/W"/> 
		<bitfield id="TYPE_138" width="1" begin="10" end="10" resetval="0x0" description=" Type for slv_events_in[74] 0=level" range="10" rwaccess="R/W"/> 
		<bitfield id="TYPE_137" width="1" begin="9" end="9" resetval="0x0" description=" Type for slv_events_in[73] 0=level" range="9" rwaccess="R/W"/> 
		<bitfield id="TYPE_136" width="1" begin="8" end="8" resetval="0x0" description=" Type for slv_events_in[72] 0=level" range="8" rwaccess="R/W"/> 
		<bitfield id="TYPE_135" width="1" begin="7" end="7" resetval="0x0" description=" Type for slv_events_in[71] 0=level" range="7" rwaccess="R/W"/> 
		<bitfield id="TYPE_134" width="1" begin="6" end="6" resetval="0x0" description=" Type for slv_events_in[70] 0=level" range="6" rwaccess="R/W"/> 
		<bitfield id="TYPE_133" width="1" begin="5" end="5" resetval="0x0" description=" Type for slv_events_in[69] 0=level" range="5" rwaccess="R/W"/> 
		<bitfield id="TYPE_132" width="1" begin="4" end="4" resetval="0x0" description=" Type for slv_events_in[68] 0=level" range="4" rwaccess="R/W"/> 
		<bitfield id="TYPE_131" width="1" begin="3" end="3" resetval="0x0" description=" Type for slv_events_in[67] 0=level" range="3" rwaccess="R/W"/> 
		<bitfield id="TYPE_130" width="1" begin="2" end="2" resetval="0x0" description=" Type for slv_events_in[66] 0=level" range="2" rwaccess="R/W"/> 
		<bitfield id="TYPE_129" width="1" begin="1" end="1" resetval="0x0" description=" Type for slv_events_in[65] 0=level" range="1" rwaccess="R/W"/> 
		<bitfield id="TYPE_128" width="1" begin="0" end="0" resetval="0x0" description=" Type for slv_events_in[64] 0=level" range="0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG0" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG0" offset="0x1100" width="32" description="">
		<bitfield id="NEST_AUTO_OVR" width="1" begin="31" end="31" resetval="0x0" description=" Nesting Level Override Automatic" range="31" rwaccess="W"/> 
		<bitfield id="NEST_HINT_0" width="9" begin="8" end="0" resetval="0x256" description=" Host Int 0 Nesting Level" range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG1" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG1" offset="0x1104" width="32" description="">
		<bitfield id="NEST_AUTO_OVR" width="1" begin="31" end="31" resetval="0x0" description=" Nesting Level Override Automatic" range="31" rwaccess="W"/> 
		<bitfield id="NEST_HINT_1" width="9" begin="8" end="0" resetval="0x256" description=" Host Int 1 Nesting Level" range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG2" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG2" offset="0x1108" width="32" description="">
		<bitfield id="NEST_AUTO_OVR" width="1" begin="31" end="31" resetval="0x0" description=" Nesting Level Override Automatic" range="31" rwaccess="W"/> 
		<bitfield id="NEST_HINT_2" width="9" begin="8" end="0" resetval="0x256" description=" Host Int 2 Nesting Level" range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG3" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG3" offset="0x110C" width="32" description="">
		<bitfield id="NEST_AUTO_OVR" width="1" begin="31" end="31" resetval="0x0" description=" Nesting Level Override Automatic" range="31" rwaccess="W"/> 
		<bitfield id="NEST_HINT_3" width="9" begin="8" end="0" resetval="0x256" description=" Host Int 3 Nesting Level" range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG4" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG4" offset="0x1110" width="32" description="">
		<bitfield id="NEST_AUTO_OVR" width="1" begin="31" end="31" resetval="0x0" description=" Nesting Level Override Automatic" range="31" rwaccess="W"/> 
		<bitfield id="NEST_HINT_4" width="9" begin="8" end="0" resetval="0x256" description=" Host Int 4 Nesting Level" range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG5" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG5" offset="0x1114" width="32" description="">
		<bitfield id="NEST_AUTO_OVR" width="1" begin="31" end="31" resetval="0x0" description=" Nesting Level Override Automatic" range="31" rwaccess="W"/> 
		<bitfield id="NEST_HINT_5" width="9" begin="8" end="0" resetval="0x256" description=" Host Int 5 Nesting Level" range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG6" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG6" offset="0x1118" width="32" description="">
		<bitfield id="NEST_AUTO_OVR" width="1" begin="31" end="31" resetval="0x0" description=" Nesting Level Override Automatic" range="31" rwaccess="W"/> 
		<bitfield id="NEST_HINT_6" width="9" begin="8" end="0" resetval="0x256" description=" Host Int 6 Nesting Level" range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG7" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG7" offset="0x111C" width="32" description="">
		<bitfield id="NEST_AUTO_OVR" width="1" begin="31" end="31" resetval="0x0" description=" Nesting Level Override Automatic" range="31" rwaccess="W"/> 
		<bitfield id="NEST_HINT_7" width="9" begin="8" end="0" resetval="0x256" description=" Host Int 7 Nesting Level" range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG8" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG8" offset="0x1120" width="32" description="">
		<bitfield id="NEST_AUTO_OVR" width="1" begin="31" end="31" resetval="0x0" description=" Nesting Level Override Automatic" range="31" rwaccess="W"/> 
		<bitfield id="NEST_HINT_8" width="9" begin="8" end="0" resetval="0x256" description=" Host Int 8 Nesting Level" range="8 - 0" rwaccess="R/W"/>
	</register>
