ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG0_PR1_ICSS_INTC_INTC_SLV.xml
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG9" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG9" offset="0x1124" width="32" description="">
		<bitfield id="NEST_AUTO_OVR" width="1" begin="31" end="31" resetval="0x0" description=" Nesting Level Override Automatic" range="31" rwaccess="W"/> 
		<bitfield id="NEST_HINT_9" width="9" begin="8" end="0" resetval="0x256" description=" Host Int 9 Nesting Level" range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG10" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG10" offset="0x1128" width="32" description="">
		<bitfield id="NEST_AUTO_OVR" width="1" begin="31" end="31" resetval="0x0" description=" Nesting Level Override Automatic" range="31" rwaccess="W"/> 
		<bitfield id="NEST_HINT_10" width="9" begin="8" end="0" resetval="0x256" description=" Host Int 10 Nesting Level" range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG11" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG11" offset="0x112C" width="32" description="">
		<bitfield id="NEST_AUTO_OVR" width="1" begin="31" end="31" resetval="0x0" description=" Nesting Level Override Automatic" range="31" rwaccess="W"/> 
		<bitfield id="NEST_HINT_11" width="9" begin="8" end="0" resetval="0x256" description=" Host Int 11 Nesting Level" range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG12" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG12" offset="0x1130" width="32" description="">
		<bitfield id="NEST_AUTO_OVR" width="1" begin="31" end="31" resetval="0x0" description=" Nesting Level Override Automatic" range="31" rwaccess="W"/> 
		<bitfield id="NEST_HINT_12" width="9" begin="8" end="0" resetval="0x256" description=" Host Int 12 Nesting Level" range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG13" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG13" offset="0x1134" width="32" description="">
		<bitfield id="NEST_AUTO_OVR" width="1" begin="31" end="31" resetval="0x0" description=" Nesting Level Override Automatic" range="31" rwaccess="W"/> 
		<bitfield id="NEST_HINT_13" width="9" begin="8" end="0" resetval="0x256" description=" Host Int 13 Nesting Level" range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG14" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG14" offset="0x1138" width="32" description="">
		<bitfield id="NEST_AUTO_OVR" width="1" begin="31" end="31" resetval="0x0" description=" Nesting Level Override Automatic" range="31" rwaccess="W"/> 
		<bitfield id="NEST_HINT_14" width="9" begin="8" end="0" resetval="0x256" description=" Host Int 14 Nesting Level" range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG15" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG15" offset="0x113C" width="32" description="">
		<bitfield id="NEST_AUTO_OVR" width="1" begin="31" end="31" resetval="0x0" description=" Nesting Level Override Automatic" range="31" rwaccess="W"/> 
		<bitfield id="NEST_HINT_15" width="9" begin="8" end="0" resetval="0x256" description=" Host Int 15 Nesting Level" range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG16" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG16" offset="0x1140" width="32" description="">
		<bitfield id="NEST_AUTO_OVR" width="1" begin="31" end="31" resetval="0x0" description=" Nesting Level Override Automatic" range="31" rwaccess="W"/> 
		<bitfield id="NEST_HINT_16" width="9" begin="8" end="0" resetval="0x256" description=" Host Int 16 Nesting Level" range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG17" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG17" offset="0x1144" width="32" description="">
		<bitfield id="NEST_AUTO_OVR" width="1" begin="31" end="31" resetval="0x0" description=" Nesting Level Override Automatic" range="31" rwaccess="W"/> 
		<bitfield id="NEST_HINT_17" width="9" begin="8" end="0" resetval="0x256" description=" Host Int 17 Nesting Level" range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG18" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG18" offset="0x1148" width="32" description="">
		<bitfield id="NEST_AUTO_OVR" width="1" begin="31" end="31" resetval="0x0" description=" Nesting Level Override Automatic" range="31" rwaccess="W"/> 
		<bitfield id="NEST_HINT_18" width="9" begin="8" end="0" resetval="0x256" description=" Host Int 18 Nesting Level" range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG19" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_NEST_LEVEL_REG19" offset="0x114C" width="32" description="">
		<bitfield id="NEST_AUTO_OVR" width="1" begin="31" end="31" resetval="0x0" description=" Nesting Level Override Automatic" range="31" rwaccess="W"/> 
		<bitfield id="NEST_HINT_19" width="9" begin="8" end="0" resetval="0x256" description=" Host Int 19 Nesting Level" range="8 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_INTC__INTC_SLV__REGS_ENABLE_HINT_REG0" acronym="PR1_ICSS_INTC__INTC_SLV__REGS_ENABLE_HINT_REG0" offset="0x1500" width="32" description="">
		<bitfield id="ENABLE_HINT_19" width="1" begin="19" end="19" resetval="0x0" description=" Enable for Host Int 19" range="19" rwaccess="R/W"/> 
		<bitfield id="ENABLE_HINT_18" width="1" begin="18" end="18" resetval="0x0" description=" Enable for Host Int 18" range="18" rwaccess="R/W"/> 
		<bitfield id="ENABLE_HINT_17" width="1" begin="17" end="17" resetval="0x0" description=" Enable for Host Int 17" range="17" rwaccess="R/W"/> 
		<bitfield id="ENABLE_HINT_16" width="1" begin="16" end="16" resetval="0x0" description=" Enable for Host Int 16" range="16" rwaccess="R/W"/> 
		<bitfield id="ENABLE_HINT_15" width="1" begin="15" end="15" resetval="0x0" description=" Enable for Host Int 15" range="15" rwaccess="R/W"/> 
		<bitfield id="ENABLE_HINT_14" width="1" begin="14" end="14" resetval="0x0" description=" Enable for Host Int 14" range="14" rwaccess="R/W"/> 
		<bitfield id="ENABLE_HINT_13" width="1" begin="13" end="13" resetval="0x0" description=" Enable for Host Int 13" range="13" rwaccess="R/W"/> 
		<bitfield id="ENABLE_HINT_12" width="1" begin="12" end="12" resetval="0x0" description=" Enable for Host Int 12" range="12" rwaccess="R/W"/> 
		<bitfield id="ENABLE_HINT_11" width="1" begin="11" end="11" resetval="0x0" description=" Enable for Host Int 11" range="11" rwaccess="R/W"/> 
		<bitfield id="ENABLE_HINT_10" width="1" begin="10" end="10" resetval="0x0" description=" Enable for Host Int 10" range="10" rwaccess="R/W"/> 
		<bitfield id="ENABLE_HINT_9" width="1" begin="9" end="9" resetval="0x0" description=" Enable for Host Int 9" range="9" rwaccess="R/W"/> 
		<bitfield id="ENABLE_HINT_8" width="1" begin="8" end="8" resetval="0x0" description=" Enable for Host Int 8" range="8" rwaccess="R/W"/> 
		<bitfield id="ENABLE_HINT_7" width="1" begin="7" end="7" resetval="0x0" description=" Enable for Host Int 7" range="7" rwaccess="R/W"/> 
		<bitfield id="ENABLE_HINT_6" width="1" begin="6" end="6" resetval="0x0" description=" Enable for Host Int 6" range="6" rwaccess="R/W"/> 
		<bitfield id="ENABLE_HINT_5" width="1" begin="5" end="5" resetval="0x0" description=" Enable for Host Int 5" range="5" rwaccess="R/W"/> 
		<bitfield id="ENABLE_HINT_4" width="1" begin="4" end="4" resetval="0x0" description=" Enable for Host Int 4" range="4" rwaccess="R/W"/> 
		<bitfield id="ENABLE_HINT_3" width="1" begin="3" end="3" resetval="0x0" description=" Enable for Host Int 3" range="3" rwaccess="R/W"/> 
		<bitfield id="ENABLE_HINT_2" width="1" begin="2" end="2" resetval="0x0" description=" Enable for Host Int 2" range="2" rwaccess="R/W"/> 
		<bitfield id="ENABLE_HINT_1" width="1" begin="1" end="1" resetval="0x0" description=" Enable for Host Int 1" range="1" rwaccess="R/W"/> 
		<bitfield id="ENABLE_HINT_0" width="1" begin="0" end="0" resetval="0x0" description=" Enable for Host Int 0" range="0" rwaccess="R/W"/>
	</register>
</module>